class Subjects {
  Subjects(this.subjects);
  Map<int, String> subjects;
}

class Schedule {
  Schedule(Map<String, Map<int, String>> scheduleRaw) {
    scheduleRaw.forEach((key, value) => dayToSubjects[key] = Subjects(value));
  }
  Map<String, Subjects> dayToSubjects = {};
}

class ScheduleData {
  ScheduleData() {
    groupToSchedule = {};
    dataRaw.forEach((key, value) => groupToSchedule[key] = Schedule(value));
  }

  Map<String, Schedule> groupToSchedule = {};

  List<String> getGroupsNames() {
    return groupToSchedule.keys.toList();
  }

  Schedule getScheduleForGroup(String groupName) {
    return groupToSchedule[groupName]!;
  }

  String getDayName(int dayIndex) {
    switch (dayIndex) {
      case 0:
        return "Понеділок";
      case 1:
        return "Вівторок";
      case 2:
        return "Середа";
      case 3:
        return "Четвер";
      case 4:
        return "П'ятниця";
      default:
    }
    return '';
  }
}

Map<String, Map<String, Map<int, String>>> dataRaw = {
  "KI-48": {
    "Понеділок": {
      1: 'Технології проектування комп`ютерних систем',
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      3: 'Захист інформації в комп`ютерних системах'
    },
    "Вівторок": {
      3: 'Архітектура спеціалізованих комп`ютерних систем',
      4: 'Діагностика комп`ютерних засобів'
    },
    "Середа": {
      3: 'Комп`ютерні засоби опрацювання сигналів',
      5: 'Технології проектування комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "Четвер": {
      4: 'Технології проектування комп`ютерних систем',
      5: 'Архітектура спеціалізованих комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "П'ятниця": {
      2: 'Діагностика комп`ютерних засобів',
      3: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Захист інформації в комп`ютерних системах'
    },
  },
  "KI-47": {
    "Понеділок": {
      3: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Технології проектування комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "Вівторок": {
      1: 'Технології проектування комп`ютерних систем',
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      3: 'Захист інформації в комп`ютерних системах'
    },
    "Середа": {
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      4: 'Діагностика комп`ютерних засобів'
    },
    "Четвер": {
      4: 'Технології проектування комп`ютерних систем',
      5: 'Архітектура спеціалізованих комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "П'ятниця": {
      2: 'Діагностика комп`ютерних засобів',
      3: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Захист інформації в комп`ютерних системах'
    },
  },
  "KI-46": {
    "Понеділок": {
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      3: 'Діагностика комп`ютерних засобів'
    },
    "Вівторок": {
      1: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Технології проектування комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "Середа": {
      1: 'Технології проектування комп`ютерних систем',
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      3: 'Захист інформації в комп`ютерних системах'
    },
    "Четвер": {
      4: 'Технології проектування комп`ютерних систем',
      5: 'Архітектура спеціалізованих комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "П'ятниця": {
      2: 'Діагностика комп`ютерних засобів',
      3: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Захист інформації в комп`ютерних системах'
    },
  },
  "KI-45": {
    "Понеділок": {
      2: 'Методи та засоби опрацювання сигналів і зображень',
      3: 'Програмні технології мобільних обчислень',
      4: 'Програмне забезпечення інтернету речей'
    },
    "Вівторок": {
      1: 'Програмне забезпечення інтернету речей',
      2: 'Мережні операційні системи',
      3: 'Програмні технології мобільних обчислень'
    },
    "Середа": {
      1: 'Методи та засоби опрацювання сигналів і зображень',
      2: 'Програмне забезпечення інтернету речей'
    },
    "Четвер": {
      3: 'Системне адміністрування комп`ютерних мереж',
      4: 'Захист інформації в комп`ютерних системах'
    },
    "П'ятниця": {
      1: 'Мережні операційні системи',
      2: 'Системне адміністрування комп`ютерних мереж',
      4: 'Захист інформації в комп`ютерних системах'
    },
  },
};
